Repository: KungFuFurby/spc-presenter-rs
Catalog: src/gui/slint/localization/*/spc-presenter-rs.po
Languages: es

# file browser: default label
source: File:
es: Archivo:

# file browser: input path placeholder
source: No file selected
es: Ningún archivo seleccionado

# file browser: open file dialog button
source: Browse...
es: Seleccionar...

# file browser: clear selected file button
source: Clear
es: Quitar

# resampling type: accurate Gaussian interpolation
source: Hardware-accurate Gaussian
es: Gaussian preciso al hardware

# resampling type: high-fidelity Gaussian interpolation
source: High-fidelity Gaussian
es: Gaussian de alta fidelidad

# resampling type: linear interpolation
source: Linear
es: Lineal

# version dialog: about button
source: About
es: Acerca de

# version dialog: close button
source: Close
es: Cerrar

# input SPC file browser label
source: Input SPC:
es: Archivo SPC:

# SPC Id666 metadata lines placeholder
source: <no metadata>
es: <ningún metadatos>

# base channel color selectors label
source: Base channel colors:
es: Colores de canales:

# config import tooltip
source: Import
es: Importar

# config export tooltip
source: Export
es: Exportar

# config reset tooltip
source: Reset
es: Reiniciar

# sample tuning section header
source: Sample tuning
es: Afinación de samples

# sample tuning import button
source: Import tunings
es: Importar afinaciones

# render background file browser label
source: Background:
es: Fondo:

# render duration label
source: Render duration:
es: Duración de video:

# render duration: seconds
source: seconds
es: segundos

# render duration: frames
source: frames
es: fotogramas

# render duration: duration from SPC Id666 header
source: SPC duration
es: duración de SPC

# render fadeout duration label
source: Fadeout frames:
es: Duración en fotogramas de fundido:

# render output resolution label
source: Output video size:
es: Resolución de video:

# sample interpolation type label
source: Sample interpolation:
es: Interpolación de samples:

# Blargg's DSP filter enable checkbox
source: Blargg's DSP post-filter
es: Usar el filtro DSP de Blargg

# cancel render button
source: Cancel
es: Cancelar

# start render button
source: Render!
es: ¡Renderizar!

# unknown formatted duration
source: <unknown>
es: <desconocido>

# unknown humanized duration
source: unknown time remaining
es: queda un tiempo desconocido

# humanized duration (hours)
source: {n} hour remaining
es: queda {n} hora

# humanized duration (minutes)
source: {n} minute remaining
es: queda {n} minuto

# humanized duration (seconds)
source: {n} second remaining
es: queda {n} segundo

# humanized duration (less than a second)
source: less than a second remaining
es: queda menos de un segundo

# progress: starting
source: Setting up
es: Configurando

# progress: rendering
source: Rendering
es: Renderizando

# progress: rendering to loop point
source: Rendering to loop point
es: Renderizando al punto de bucle

# progress: initializing
source: Initializing
es: Inicializando

# progress: detecting samples
source: Detecting samples
es: Detectando samples

# progress: processing samples
source: Processing samples
es: Procesando samples

# progress: idle
source: Idle
es: Ocioso

# progress status: render error
source: Render error: {}
es: Error mientras renderizaba: {}

# progress status: render starting
source: Preparing your music
es: Preparando su música

# progress status: rendering
source: {}%, {} FPS, encoded {}/{} ({}), {}
es: {}%, {} FPS, codificado {}/{} ({}), {}

# progress status: render finished
source: Render finished
es: Render finalizado

# progress status: render cancelled
source: Render cancelled
es: Render cancelado

# progress status: processor error
source: Processor error: {}
es: Error mientras procesaba: {}

# progress status: processor starting
source: Preparing to detect samples
es: Preparando para detectar samples

# progress status: detecting samples
source: {}%, found {}
es: {}%, detectaba {}

# progress status: processing samples
source: {}%, processing sample {} ({}/{})
es: {}%, procesando sample {} ({}/{})

# progress status: processor finished
source: Processing finished
es: Procesando finalizado

# progress status: processor cancelled
source: Processing cancelled
es: Procesando cancelado

# pitch type: automatic
source: Automatic
es: Automático

# pitch type: manually specified frequency
source: Frequency
es: Frequencia

# pitch type: AddMusicK tuning parameters
source: AddMusicK tuning
es: Afinación AddMusicK

# sample config: config pane placeholder text
source: <no sample selected>
es: <ningún sample selectado>

# sample config: dump sample button
source: Dump
es: Copiar

# sample config: decrease preview piano octave button tooltip
source: Decrease preview octave
es: Disminuir octava de avance

# sample config: increase preview piano octave button tooltip
source: Increase preview octave
es: Aumentar octava de avance

# sample config: DSP VxPITCH register value label
source: Pitch:
es: Tono:

# sample config: AddMusicK tuning param (keep short!)
source: Tuning
es: Afin.

# sample config: per-sample color selector label
source: Per-sample color:
es: Color para este sample:
